ElectronicCats/ArduinoCore-nRF528x-mbedos/boards.txt
##############################################################




##############################################################




##############################################################

nano33ble.name=Arduino Nano 33 BLE
nano33ble.build.core=arduino
nano33ble.build.crossprefix=arm-none-eabi-
nano33ble.build.compiler_path={runtime.tools.arm-none-eabi-gcc.path}/bin/

nano33ble.build.variant=ARDUINO_NANO33BLE
nano33ble.build.mcu=cortex-m4
nano33ble.build.extra_flags=
nano33ble.build.architecture=cortex-m4
nano33ble.build.board=ARDUINO_NANO33BLE
nano33ble.build.ldscript=linker_script.ld
nano33ble.compiler.mbed.arch.define=-DARDUINO_ARCH_NRF52840
nano33ble.compiler.mbed.defines={build.variant.path}/defines.txt
nano33ble.compiler.mbed.ldflags={build.variant.path}/ldflags.txt
nano33ble.compiler.mbed.cflags={build.variant.path}/cflags.txt
nano33ble.compiler.mbed.cxxflags={build.variant.path}/cxxflags.txt
nano33ble.compiler.mbed.includes={build.variant.path}/includes.txt
nano33ble.compiler.mbed.extra_ldflags=-lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
nano33ble.compiler.mbed="{build.variant.path}/libs/libmbed.a" "{build.variant.path}/libs/libcc_310_core.a" "{build.variant.path}/libs/libcc_310_ext.a" "{build.variant.path}/libs/libcc_310_trng.a"
nano33ble.vid.0=0x2341
nano33ble.pid.0=0x005a
nano33ble.vid.1=0x2341
nano33ble.pid.1=0x805a

nano33ble.upload.tool=bossac
nano33ble.upload.protocol=
nano33ble.upload.use_1200bps_touch=true
nano33ble.upload.wait_for_upload_port=true
nano33ble.upload.native_usb=true
nano33ble.upload.maximum_size=983040
nano33ble.upload.maximum_data_size=262144

nano33ble.bootloader.tool=openocd
nano33ble.bootloader.extra_action.preflash=nrf5 mass_erase
nano33ble.bootloader.config=-f target/nrf52.cfg
nano33ble.bootloader.programmer=-f interface/cmsis-dap.cfg
nano33ble.bootloader.file=nano33ble/bootloader.hex

# BAST BLE
bastble.name=Electronic Cats Bast BLE
bastble.build.core=arduino
bastble.build.crossprefix=arm-none-eabi-
bastble.build.compiler_path={runtime.tools.arm-none-eabi-gcc.path}/bin/

bastble.build.variant=bast_ble
bastble.build.mcu=cortex-m4
bastble.build.extra_flags=
bastble.build.architecture=cortex-m4
bastble.build.board=bast_ble
bastble.build.ldscript=linker_script.ld
bastble.compiler.mbed.arch.define=-DARDUINO_ARCH_NRF52840
bastble.compiler.mbed.defines={build.variant.path}/defines.txt
bastble.compiler.mbed.ldflags={build.variant.path}/ldflags.txt
bastble.compiler.mbed.cflags={build.variant.path}/cflags.txt
bastble.compiler.mbed.cxxflags={build.variant.path}/cxxflags.txt
bastble.compiler.mbed.includes={build.variant.path}/includes.txt
bastble.compiler.mbed.extra_ldflags=-lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
bastble.compiler.mbed="{build.variant.path}/libs/libmbed.a" "{build.variant.path}/libs/libcc_310_core.a" "{build.variant.path}/libs/libcc_310_ext.a" "{build.variant.path}/libs/libcc_310_trng.a"
bastble.vid.0=0x1209
bastble.pid.0=0x005a
bastble.vid.1=0x1209
bastble.pid.1=0x805a

# Upload
bastble.bootloader.tool=bootburn
bastble.upload.tool=nrfutil
bastble.upload.protocol=nrfutil
bastble.upload.use_1200bps_touch=true
bastble.upload.wait_for_upload_port=true
bastble.upload.maximum_size=983040
bastble.upload.maximum_data_size=262144

bastble.bootloader.tool=openocd
bastble.bootloader.extra_action.preflash=nrf5 mass_erase
bastble.bootloader.config=-f target/nrf52.cfg
bastble.bootloader.programmer=-f interface/cmsis-dap.cfg
bastble.bootloader.file=bastble/bast_ble_bootloader-0.3.2.hex